"""
这里定义一些全局参数
"""
import os

class gvariable:
    """全局变量"""
    import ocrstock
    work_path=ocrstock.__path__[0]

    # 日志目录
    logpath=os.path.join(work_path,r'logs\_logfile')

    # 子图片存放位置
    picpath=os.path.join(work_path,'pic')

# 图标信息汇总
# 图标文件名称，二值化阈值，搜索范围
pic_info={
    '买入_买入确认':{'bin':210, 'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]} ,
    '买入_重填':    {'bin':210, 'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]},
    '买入_证券代码':{'bin':210, 'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]},
    '买入_买入价格':{'bin':210, 'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]},
    '买入_买入数量':{'bin':210, 'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]},
    '买入_买入页':  {'bin':200, 'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]},

    '卖出_卖出确认': {'bin': 210, 'xrange': [0 / 768, 286 / 768], 'yrange': [170 / 1366, 610 / 1366]},
    '卖出_重填':     {'bin':210,  'xrange':[0/768, 768/768], 'yrange':[170/1366, 610/1366]},
    '卖出_证券代码': {'bin': 210, 'xrange': [0 / 768, 286 / 768], 'yrange': [170 / 1366, 610 / 1366]},
    '卖出_卖出价格': {'bin': 210, 'xrange': [0 / 768, 286 / 768], 'yrange': [170 / 1366, 610 / 1366]},
    '卖出_卖出数量': {'bin': 210, 'xrange': [0 / 768, 286 / 768], 'yrange': [170 / 1366, 610 / 1366]},
    '卖出_卖出页':   {'bin': 200, 'xrange': [0 / 768, 286 / 768], 'yrange': [170 / 1366, 610 / 1366]},


    '界面_标题':{'bin':200, 'xrange':[0/768, 100/768], 'yrange':[0/1366, 300/1366]},
    '界面_已最大化窗口':{'bin':150, 'xrange':[0/768, 20/768], 'yrange':[1270/1366, 1366/1366]},
    '界面_需最大化窗口':{'bin':150, 'xrange':[0/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '界面_任务栏图标':{'bin':100, 'xrange':[700/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '界面_解锁密码':{'bin':200, 'xrange':[0/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '界面_解锁确认':{'bin':100, 'xrange':[0/768, 768/768], 'yrange':[0/1366, 1366/1366]},


    '资金汇总_资金汇总页': {'bin':200, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},
    '资金汇总_资金余额': {'bin':100, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},
    '资金汇总_冻结金额': {'bin':100, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},
    '资金汇总_可用金额': {'bin':100, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},
    '资金汇总_可取金额': {'bin':100, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},
    '资金汇总_股票市值': {'bin':100, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},
    '资金汇总_总资产': {'bin':100, 'xrange':[65/768, 180/768], 'yrange':[160/1366, 510/1366]},

    '持仓_证券代码':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_证券名称':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_股票余额':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_可用余额':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_冻结数量':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_盈亏':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_成本价':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_盈亏比':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_市价':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_市值':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_交易市场':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_股东账户':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},
    '持仓_实际数量':{'bin':200, 'xrange':[150/768, 768/768], 'yrange':[0/1366, 1366/1366]},

    '持仓_汇总':{'bin':100, 'xrange':[670/768, 800/768], 'yrange':[0/1366, 500/1366]},
}

